#### Terraform Format and Style 🖌``
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform

Running plan in HCP Terraform. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/teste-carla/novo-workspace/runs/run-ko1gC5XGfhjWXwJ6

Waiting for the plan to start...

Terraform v1.9.5
on linux_amd64
Initializing plugins and modules...
data.aws_lbs.tech_lbs: Refreshing...
aws_eks_node_group.techNode: Refreshing state... [id=tech:techNode]
aws_eks_cluster.tech: Refreshing state... [id=tech]
data.aws_lbs.tech_lbs: Refresh complete after 1s [id=us-east-1]
aws_eks_cluster.tech: Drift detected (update)
aws_eks_node_group.techNode: Drift detected (update)

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform will perform the following actions:

  # aws_api_gateway_integration.proxy will be created
  + resource "aws_api_gateway_integration" "proxy" {
      + cache_namespace         = (known after apply)
      + connection_id           = (known after apply)
      + connection_type         = "VPC_LINK"
      + content_handling        = "CONVERT_TO_TEXT"
      + http_method             = "ANY"
      + id                      = (known after apply)
      + integration_http_method = "ANY"
      + passthrough_behavior    = "WHEN_NO_MATCH"
      + request_parameters      = {
          + "integration.request.header.Accept"        = "'application/json'"
          + "integration.request.header.Authorization" = "method.request.header.Authorization"
          + "integration.request.path.proxy"           = "method.request.path.proxy"
        }
      + resource_id             = (known after apply)
      + rest_api_id             = (known after apply)
      + timeout_milliseconds    = 29000
      + type                    = "HTTP_PROXY"
      + uri                     = "http://a2e8081d793fc4d8abaeea9dc4112fb7-aacd053f04726e2f.elb.us-east-1.amazonaws.com/{proxy}"
    }

  # aws_api_gateway_method.proxy will be created
  + resource "aws_api_gateway_method" "proxy" {
      + api_key_required   = false
      + authorization      = "NONE"
      + http_method        = "ANY"
      + id                 = (known after apply)
      + request_parameters = {
          + "method.request.header.Authorization" = true
          + "method.request.path.proxy"           = true
        }
      + resource_id        = (known after apply)
      + rest_api_id        = (known after apply)
    }

  # aws_api_gateway_resource.proxy will be created
  + resource "aws_api_gateway_resource" "proxy" {
      + id          = (known after apply)
      + parent_id   = (known after apply)
      + path        = (known after apply)
      + path_part   = "{proxy+}"
      + rest_api_id = (known after apply)
    }

  # aws_api_gateway_rest_api.main will be created
  + resource "aws_api_gateway_rest_api" "main" {
      + api_key_source               = (known after apply)
      + arn                          = (known after apply)
      + binary_media_types           = (known after apply)
      + created_date                 = (known after apply)
      + description                  = "Foobar Gateway VPC Link. Managed by Terraform."
      + disable_execute_api_endpoint = (known after apply)
      + execution_arn                = (known after apply)
      + id                           = (known after apply)
      + minimum_compression_size     = -1
      + name                         = "tech_gateway"
      + policy                       = (known after apply)
      + root_resource_id             = (known after apply)
      + tags_all                     = (known after apply)

      + endpoint_configuration {
          + types            = [
              + "REGIONAL",
            ]
          + vpc_endpoint_ids = (known after apply)
        }
    }

  # aws_api_gateway_vpc_link.main will be created
  + resource "aws_api_gateway_vpc_link" "main" {
      + arn         = (known after apply)
      + description = "Foobar Gateway VPC Link. Managed by Terraform."
      + id          = (known after apply)
      + name        = "tech_vpclink"
      + tags_all    = (known after apply)
      + target_arns = [
          + "arn:aws:elasticloadbalancing:us-east-1:019248244455:loadbalancer/net/a2e8081d793fc4d8abaeea9dc4112fb7/aacd053f04726e2f",
        ]
    }

  # aws_eks_cluster.tech will be destroyed
  - resource "aws_eks_cluster" "tech" {
      - arn                   = "arn:aws:eks:us-east-1:019248244455:cluster/tech" -> null
      - certificate_authority = [
          - {
              - data = "LS0tLS1CRUdJTiBDRVJUSUZJQ0FURS0tLS0tCk1JSURCVENDQWUyZ0F3SUJBZ0lJWlc0OElaQ1diakl3RFFZSktvWklodmNOQVFFTEJRQXdGVEVUTUJFR0ExVUUKQXhNS2EzVmlaWEp1WlhSbGN6QWVGdzB5TkRBNU1Ua3lNVFUxTlRCYUZ3MHpOREE1TVRjeU1qQXdOVEJhTUJVeApFekFSQmdOVkJBTVRDbXQxWW1WeWJtVjBaWE13Z2dFaU1BMEdDU3FHU0liM0RRRUJBUVVBQTRJQkR3QXdnZ0VLCkFvSUJBUUNleWhZS0dBdEpnMDZGU3hPbk1OVWJhZGE0c1JJdEZsMTg2ZHYzdklHQXVGS2RmRTZ6S2VaVFV6QzkKMDFyeDIzMllNRHliZHZBZUZQS3RKTVU2QVZxSDJiNUtUVkNXYTNvVjhpSlMxNVBUY0R5OGhqUTg4T1hKYlZTZgpFRlBVcHNvMWIxcVRJVWNvdHh1V2RaYUc3UmphZlRpK2Z4R0lWVEJDTkJjUGtvQXczVmN4ajhSVjlVb1lyR0dMCmNyclZVRnU5akg1dk1Ia2M4ZHc5SlRSaVNoaG5pWmRiay93TS9vS3VPRlZtenI4Z05rZlF4blcyUHNvaklyc1UKUUJ5Y3J6dThRUnRxdXczVVk5c2pET21xMW9YNGdWMUdLVk5lY0ZFSEdCZXJkeSs2Z1pTQVpUVERnNmlQUm9qOApmV0VweUFKV0xiNkFBVTFPUW00MnRDTjlkK1k5QWdNQkFBR2pXVEJYTUE0R0ExVWREd0VCL3dRRUF3SUNwREFQCkJnTlZIUk1CQWY4RUJUQURBUUgvTUIwR0ExVWREZ1FXQkJSSkJRd1F4Zk1tU0R3UkxoNlU0eFNENWFQcGVUQVYKQmdOVkhSRUVEakFNZ2dwcmRXSmxjbTVsZEdWek1BMEdDU3FHU0liM0RRRUJDd1VBQTRJQkFRQlYzN0pEU2MwWQpYRkZ2bkJlVDdXdE1YNDd1NVBZODU3M0pJQkhPWVdydlpITm55UzM2YVIzbm4xaWFMUkEyZmJyV3lYcWxUdktUCmxZMGt2aEdRL2RVeitzQmRLVzVyaHBIZFVHcVJFSUFES2k2d3Q1WDFRSnN4QjJpdWRSc01uU2pKV1c2NWxMRSsKb2tOTDVRWFcrc01EYjVGZjFyWjJpZEhOTSt2dkd6QytrSGlvMTZHcGF1SnhMdlZjbDdyd2VpSVFONDYzQ1VyOQpCb0RIK0Q2amRSdFU0dHhiYU8vcCtQOVhTZStHdDJZakpqcTh4SUxOMGQ0VVRpOWtPSzhjb3F6VUxYckJERGt4Cm5YTFd5UlpyMW0zNEtNRlRTMTQrRzRWL2ExWHhndHhzYXUyNTZhWXhkclgzUGJ6ZGl5RXdBOUcxWWZmRUZUOGYKOTYzZ2xZU2E5ZEt4Ci0tLS0tRU5EIENFUlRJRklDQVRFLS0tLS0K"
            },
        ] -> null
      - created_at            = "2024-09-19 21:55:44.573 +0000 UTC" -> null
      - endpoint              = "https://EF488ADCB23D699EB8598FDF573F334E.gr7.us-east-1.eks.amazonaws.com" -> null
      - id                    = "tech" -> null
      - identity              = [
          - {
              - oidc = [
                  - {
                      - issuer = "https://oidc.eks.us-east-1.amazonaws.com/id/EF488ADCB23D699EB8598FDF573F334E"
                    },
                ]
            },
        ] -> null
      - name                  = "tech" -> null
      - platform_version      = "eks.8" -> null
      - role_arn              = "arn:aws:iam::019248244455:role/LabRole" -> null
      - status                = "ACTIVE" -> null
      - tags_all              = {} -> null
      - version               = "1.30" -> null

      - kubernetes_network_config {
          - ip_family         = "ipv4" -> null
          - service_ipv4_cidr = "10.100.0.0/16" -> null
            # (1 unchanged attribute hidden)
        }

      - vpc_config {
          - cluster_security_group_id = "sg-06a7b42e39de4e632" -> null
          - endpoint_private_access   = false -> null
          - endpoint_public_access    = true -> null
          - public_access_cidrs       = [
              - "0.0.0.0/0",
            ] -> null
          - subnet_ids                = [
              - "subnet-07d190e14405105b0",
              - "subnet-0999539928723d781",
              - "subnet-0c6712171ff29cfd3",
              - "subnet-0e5d6405ea49d3b76",
              - "subnet-0f4ce9ecc660cd3f2",
            ] -> null
          - vpc_id                    = "vpc-0b3526d1faba8abfc" -> null
        }
    }

  # aws_eks_node_group.techNode will be destroyed
  - resource "aws_eks_node_group" "techNode" {
      - ami_type               = "AL2023_x86_64_STANDARD" -> null
      - arn                    = "arn:aws:eks:us-east-1:019248244455:nodegroup/tech/techNode/54c90628-2e03-1e80-1d55-b8aea7ce0760" -> null
      - capacity_type          = "ON_DEMAND" -> null
      - cluster_name           = "tech" -> null
      - disk_size              = 20 -> null
      - id                     = "tech:techNode" -> null
      - instance_types         = [
          - "t3.small",
        ] -> null
      - node_group_name        = "techNode" -> null
      - node_role_arn          = "arn:aws:iam::019248244455:role/LabRole" -> null
      - release_version        = "1.30.4-20240917" -> null
      - resources              = [
          - {
              - autoscaling_groups              = [
                  - {
                      - name = "eks-techNode-54c90628-2e03-1e80-1d55-b8aea7ce0760"
                    },
                ]
                # (1 unchanged attribute hidden)
            },
        ] -> null
      - status                 = "ACTIVE" -> null
      - subnet_ids             = [
          - "subnet-07d190e14405105b0",
          - "subnet-0999539928723d781",
          - "subnet-0c6712171ff29cfd3",
          - "subnet-0e5d6405ea49d3b76",
          - "subnet-0f4ce9ecc660cd3f2",
        ] -> null
      - tags_all               = {} -> null
      - version                = "1.30" -> null
        # (1 unchanged attribute hidden)

      - scaling_config {
          - desired_size = 1 -> null
          - max_size     = 1 -> null
          - min_size     = 1 -> null
        }

      - update_config {
          - max_unavailable            = 1 -> null
          - max_unavailable_percentage = 0 -> null
        }
    }

Plan: 5 to add, 0 to change, 2 to destroy.

Changes to Outputs:
  - endpoint                              = "https://EF488ADCB23D699EB8598FDF573F334E.gr7.us-east-1.eks.amazonaws.com" -> null
  - kubeconfig-certificate-authority-data = "LS0tLS1CRUdJTiBDRVJUSUZJQ0FURS0tLS0tCk1JSURCVENDQWUyZ0F3SUJBZ0lJWlc0OElaQ1diakl3RFFZSktvWklodmNOQVFFTEJRQXdGVEVUTUJFR0ExVUUKQXhNS2EzVmlaWEp1WlhSbGN6QWVGdzB5TkRBNU1Ua3lNVFUxTlRCYUZ3MHpOREE1TVRjeU1qQXdOVEJhTUJVeApFekFSQmdOVkJBTVRDbXQxWW1WeWJtVjBaWE13Z2dFaU1BMEdDU3FHU0liM0RRRUJBUVVBQTRJQkR3QXdnZ0VLCkFvSUJBUUNleWhZS0dBdEpnMDZGU3hPbk1OVWJhZGE0c1JJdEZsMTg2ZHYzdklHQXVGS2RmRTZ6S2VaVFV6QzkKMDFyeDIzMllNRHliZHZBZUZQS3RKTVU2QVZxSDJiNUtUVkNXYTNvVjhpSlMxNVBUY0R5OGhqUTg4T1hKYlZTZgpFRlBVcHNvMWIxcVRJVWNvdHh1V2RaYUc3UmphZlRpK2Z4R0lWVEJDTkJjUGtvQXczVmN4ajhSVjlVb1lyR0dMCmNyclZVRnU5akg1dk1Ia2M4ZHc5SlRSaVNoaG5pWmRiay93TS9vS3VPRlZtenI4Z05rZlF4blcyUHNvaklyc1UKUUJ5Y3J6dThRUnRxdXczVVk5c2pET21xMW9YNGdWMUdLVk5lY0ZFSEdCZXJkeSs2Z1pTQVpUVERnNmlQUm9qOApmV0VweUFKV0xiNkFBVTFPUW00MnRDTjlkK1k5QWdNQkFBR2pXVEJYTUE0R0ExVWREd0VCL3dRRUF3SUNwREFQCkJnTlZIUk1CQWY4RUJUQURBUUgvTUIwR0ExVWREZ1FXQkJSSkJRd1F4Zk1tU0R3UkxoNlU0eFNENWFQcGVUQVYKQmdOVkhSRUVEakFNZ2dwcmRXSmxjbTVsZEdWek1BMEdDU3FHU0liM0RRRUJDd1VBQTRJQkFRQlYzN0pEU2MwWQpYRkZ2bkJlVDdXdE1YNDd1NVBZODU3M0pJQkhPWVdydlpITm55UzM2YVIzbm4xaWFMUkEyZmJyV3lYcWxUdktUCmxZMGt2aEdRL2RVeitzQmRLVzVyaHBIZFVHcVJFSUFES2k2d3Q1WDFRSnN4QjJpdWRSc01uU2pKV1c2NWxMRSsKb2tOTDVRWFcrc01EYjVGZjFyWjJpZEhOTSt2dkd6QytrSGlvMTZHcGF1SnhMdlZjbDdyd2VpSVFONDYzQ1VyOQpCb0RIK0Q2amRSdFU0dHhiYU8vcCtQOVhTZStHdDJZakpqcTh4SUxOMGQ0VVRpOWtPSzhjb3F6VUxYckJERGt4Cm5YTFd5UlpyMW0zNEtNRlRTMTQrRzRWL2ExWHhndHhzYXUyNTZhWXhkclgzUGJ6ZGl5RXdBOUcxWWZmRUZUOGYKOTYzZ2xZU2E5ZEt4Ci0tLS0tRU5EIENFUlRJRklDQVRFLS0tLS0K" -> null

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @CarlaCCP, Action: `pull_request`*